{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "AK",
    "1": "BCC",
    "2": "BKL",
    "3": "DF",
    "4": "MEL",
    "5": "NV",
    "6": "SCC",
    "7": "VASC"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "AK": "0",
    "BCC": "1",
    "BKL": "2",
    "DF": "3",
    "MEL": "4",
    "NV": "5",
    "SCC": "6",
    "VASC": "7"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.39.3"
}
